04_Simulation/PH_2D_RANS_v2f_baseline_pimpleURANS/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//libs ("./lib/kOmegaSSTx.so");

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         400;

deltaT          0.001;

writeControl    adjustableRunTime; //timeStep;

writeInterval   10; //0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

//runTimeModifiable false;
runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           5;

// ************************************************************************* //
