04_Simulation/PH_2D_RANS_v2f_baseline_pimpleURANS/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(8.4788275e-11 -1.7187159e-09 -5.939837e-29 6.6666667e-11 -0 6.6666667e-11)
(6.816757e-11 -1.7188368e-09 -1.0686702e-24 6.6666667e-11 -0 6.6666667e-11)
(-2.7745788e-11 -1.7184666e-09 -1.067907e-24 6.6666667e-11 -0 6.6666667e-11)
(-2.0236527e-10 -1.7168491e-09 -5.3327266e-25 6.6666667e-11 -0 6.6666667e-11)
(-4.5289251e-10 -1.7132362e-09 -5.336923e-25 6.6666667e-11 -0 6.6666667e-11)
(-7.7438078e-10 -1.7068943e-09 -5.3437113e-25 6.6666667e-11 -0 6.6666667e-11)
(-1.1548343e-09 -1.6971077e-09 -5.2730644e-25 6.6666667e-11 -0 6.6666667e-11)
(-1.5443133e-09 -1.6832739e-09 1.6510924e-28 6.6666667e-11 -0 6.6666667e-11)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
        value           uniform (6.6666667e-11 0 0 6.6666667e-11 -0 6.6666667e-11);
    }
    hills
    {
        type            fixedValue;
        value           uniform (6.6666667e-11 -0 -0 6.6666667e-11 -0 6.6666667e-11);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
